{
  "success": true,
  "statusCode": 200,
  "data": {
    "id": "6ceebd49-339e-4cd4-acdc-3f6e1c835c06",
    "url": "https://www.upwork.com/jobs/Freelance-Frontend-Software-Engineer-React-Timer-Component_%7E01324b4e1239d722e7?source=rss",
    "title": "Freelance Frontend Software Engineer - React Timer Component - Upwork",
    "description": "About Us:  \nWe are seeking an experienced frontend software engineer to join us on a freelance basis. Whether you have a full-time job or have previously worked for a software company, if you're looking to earn extra income and contribute to an exciting project, this opportunity is perfect for you.  \n  \nRequirements:  \n  \nMinimum 3+ years of experience in frontend development.  \nProficient in JavaScript/Typescript and React.js.  \nStrong expertise in building reusable components.  \nFamiliarity with Tailwind CSS or other CSS frameworks.  \nAbility to work independently and deliver high-quality code.  \n  \nRole and Responsibilities:  \nWe are looking for a talented individual to develop a reusable React component that functions similarly to Toggl's timer. The component should allow users to select tasks, choose days of the week, and start a timer to log hours for the day. You have the freedom to choose your preferred language, ensuring you leverage your strengths.  \n  \n  \n**Budget**: $120  \n**Posted On**: November 17, 2023 22:27 UTC  \n**Category**: Front-End Development  \n**Skills**:Tailwind CSS, Bootstrap, React, TypeScript, Redux, CSS, HTML5, JavaScript, Web Application, Node.js  \n  \n**Country**: Pakistan  \n[click to apply](https://www.upwork.com/jobs/Freelance-Frontend-Software-Engineer-React-Timer-Component_%7E01324b4e1239d722e7?source=rss)",
    "published": "2023-11-17T22:27:55.000Z",
    "keywords": [
      "Frontend development",
      "JavaScript",
      "Typescript",
      "React.js",
      "Tailwind CSS",
      "Bootstrap",
      "CSS frameworks",
      "Redux",
      "Node.js"
    ],
    "score": 29,
    "matchedCases": 10,
    "matchedCasesData": [
      {
        "link": "https://portfolio.abcloudz.com/web-tool-design-editing/",
        "docId": "8d425010-8b90-4cc3-94f0-18b57c496e31",
        "score": 0.46544847098300113,
        "title": "Web Tool for design editing",
        "content": "- Summary: Web Tool for design editing is a graphic design platform that allows for creating visual content such as social media posts, graphics, presentations, posters, etc. The platform stores plenty of templates, illustrations, and fonts that users can apply in order to create a new piece of content. Our team developed an admin panel that allows for uploading many more new templates and a handy template editor. Technology-wise, we used the means of HTML, Angular, AWS, and Fabric.js.\n  - Platforms: WebOS\n  - Devices: Desktop\n  - Programming Languages: HTML\n  - Industry: Painting & Photos\n  - Tags: web-development, website",
        "selected": true,
        "webDocId": 317,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": "WebOS"
          },
          {
            "key": "Devices",
            "value": "Desktop"
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": "web-development, website"
          },
          {
            "key": "Categories",
            "value": ""
          },
          {
            "key": "Published",
            "value": "2020-08-19T16:45:23"
          }
        ]
      },
      {
        "link": "https://portfolio.abcloudz.com/mirai-global-website/",
        "docId": "fb05655c-cfc6-4d87-82eb-6016915e41be",
        "score": 0.454720721998195,
        "title": "Mirai",
        "content": "- Summary: Mirai is a moderate project about making responsive web pages for a corporate site. The idea was to create a slew of pages that contain necessary information about the company life and add interactivity elements to increase users' awareness of the brand. On top of a landing page, our developers introduced a number of pages that contained feedback and contact forms, as well as embedded video functionality, and the navigation menu available on all pages. What's more, we have adjusted these pages to be responsive and support all the actual iOS and PC resolutions to compliment browser support for Safari, Google Chrome, Mozilla Firefox, and Internet Explorer. To make a quick work of a project, our developers used the front end means of HTML, CSS, and Angular combined with JQuery. Technologies: HTML, CSS, Angular, JQuery\n  - Programming Languages: HTML",
        "selected": true,
        "webDocId": 315,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": ""
          },
          {
            "key": "Devices",
            "value": ""
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": ""
          },
          {
            "key": "Published",
            "value": "2020-08-19T13:12:21"
          }
        ]
      },
      {
        "link": "https://portfolio.abcloudz.com/scramble-grams/",
        "docId": "29f2dbc1-81a5-41f6-b5d8-16fe03df914d",
        "score": 0.4088915762635612,
        "content": "- Summary: We are glad to announce one of our latest projects, Scramblegrams — an exciting online application that offers a new and fresh take on the classic word tabletop game Scrabble. This platform provides a convenient and accessible way for users to enjoy the game of Scramblegrams from the comfort of their own home or while \\[…\\]\n  - Platforms: Web\n  - Devices: Desktop, mobile\n  - Tech stack: React.js, MUI, Node.js, AWS, PostgreSQL, WebSockets, RedisIO\n  - Scope of work: business analysis, UI/UX design, front-end and back-end development, quality assurance\n  - Industry: Entertainment\n  - Tags: ux, web-app, ui",
        "selected": true
      },
      {
        "link": "https://portfolio.abcloudz.com/heads-up/",
        "docId": "faad755c-034d-4d98-b25b-c99b1e9b6ad4",
        "score": 0.4042298552852963,
        "title": "Heads Up",
        "content": "- Summary: A web-portal intended to simplify textbook adoption process for teachers, and to help students find necessary books and get good deals on them.\n  - Platforms: Windows, Windows 8\n  - Devices: Desktop, Web\n  - Programming Languages: AJAX, C#, CSS, HTML5, JavaScript, jQuery, SQL Server, XML\n  - Technologies: MS SQL Server, Windows Azure\n  - Industry: Education, Info website, Learning cources, Publishing, Social Community, Website\n  - Tags: jquery, asp .net mvc framework, azure, c#, css, xml, ms sql, bootstrap, html5, amazon, web",
        "selected": true,
        "webDocId": 223,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": "Windows, Windows 8"
          },
          {
            "key": "Devices",
            "value": "Desktop, Web"
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": "jquery, asp .net mvc framework, azure, c#, css, xml, ms sql, bootstrap, html5, amazon, web"
          },
          {
            "key": "Categories",
            "value": "Web Development"
          },
          {
            "key": "Published",
            "value": "2015-03-02T09:08:24"
          }
        ]
      },
      {
        "link": "https://portfolio.abcloudz.com/flip-to/",
        "docId": "96831251-22a5-498d-8920-f4cc5324b915",
        "score": 0.37399444735083365,
        "title": "Flip.to",
        "content": "- Summary: A powerful marketing tool for hotel industry, which attracts customers on 3rd party web sites.\n  - Devices: Web\n  - Programming Languages: C#, JavaScript\n  - Industry: Business, Hospitality, Hotels\n  - Tags: responsive design, javascript, asp .net mvc framework, c#, website, AngularJS, web",
        "selected": true,
        "webDocId": 221,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": ""
          },
          {
            "key": "Devices",
            "value": "Web"
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": "responsive design, javascript, asp .net mvc framework, c#, website, AngularJS, web"
          },
          {
            "key": "Categories",
            "value": ""
          },
          {
            "key": "Published",
            "value": "2015-02-25T13:24:43"
          }
        ]
      },
      {
        "link": "https://portfolio.abcloudz.com/",
        "docId": "3188f38f-6865-42a7-9750-f690dfbbc99b",
        "score": 0.3724268604945796,
        "title": "Application Development Portfolio",
        "content": "- Summary: ABCloudz is a global IT Consulting and App Development company focused on building web, mobile and IoT business applications utilizing the latest technologies and cloud architectures. Our team has developed multiple ground-breaking products and created many impressive mobile apps with over 350 mobile apps and over 150 websites and business apps delivered. ABCloudz is built \\[…\\]",
        "selected": true,
        "webDocId": 119,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": ""
          },
          {
            "key": "Devices",
            "value": ""
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": ""
          },
          {
            "key": "Published",
            "value": "2021-11-10T13:43:23"
          }
        ]
      },
      {
        "link": "https://portfolio.abcloudz.com/linktops/",
        "docId": "e907cee2-27e8-406d-8974-0a6056efc2e5",
        "score": 0.3686163205733115,
        "title": "LinkTops",
        "content": "- Summary: The LinkTops is а multi-purpose landing page with flexible functionality.\n  - Devices: Web\n  - Programming Languages: PHP\n  - Technologies: MySQL, PayPal\n  - Industry: E-commerce, Website\n  - Tags: mysql, php, bootstrap, web, Laravel",
        "selected": true,
        "webDocId": 216,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": ""
          },
          {
            "key": "Devices",
            "value": "Web"
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": "mysql, php, bootstrap, web, Laravel"
          },
          {
            "key": "Categories",
            "value": ""
          },
          {
            "key": "Published",
            "value": "2015-02-04T03:59:33"
          }
        ]
      },
      {
        "link": "https://portfolio.abcloudz.com/instructrr-platform/",
        "docId": "f0f1c2d6-ceb6-4e31-8ae3-7208d2db09d7",
        "score": 0.36607179843951543,
        "content": "- Summary: We developed the Instructrr web and iOS apps for the online fitness community. It provides tools and services on the health and fitness market. The all-in-one Instructrr platform is designed for real-time, two-way coaching. Instructors can create their own virtual studio and connect with clients, get sign-ups, and manage their day-to-day business. Clients can conveniently \\[…\\]\n  - Platforms: Web, iOS\n  - Devices: Desktop, iPad, iPhone\n  - Tech stack: Java SE 11, React.js, RabbitMQ, MySQL, Quartz, Stripe, Twilio, Qencode, Amazon S3, MapStruct, Flyway, Swift, RxSwift, RxCocoa, Spotify iOS SDK\n  - Scope of work: Wireframes design, iOS client development, back-end and front-end development, website and server-side architecture and development, software design and architecture, deployment, quality assurance\n  - Industry: Fitness",
        "selected": true
      },
      {
        "link": "https://portfolio.abcloudz.com/amaxra/",
        "docId": "36aa1242-f9e0-4d9f-bd5c-f223cc68b3d8",
        "score": 0.3609168910433722,
        "title": "Amaxra",
        "content": "- Summary: Amaxra is an exciting SharePoint-based project aimed at building teams for collaborative development. The main customer requests during development were the ease of content management and strict design. While designing the user interface, we've used our interactive scrollable carousel that was specifically developed for Microsoft SharePoint 2013 and other elements, such as a foldable footer with contact information and live tiles. The blog section also differs from the pre-installed design, as the ABCloudz team has significantly improved user experience by making strict and plain additions to the user interface. If this is the kind of service you're looking for and you want to see more, check out our video presentation above.\n  - Platforms: Android, BlackBerry OS, iOS, Mac OS, WebOS, Windows\n  - Devices: Web\n  - Programming Languages: CSS, HTML5, JavaScript\n  - Technologies: SharePoint\n  - Industry: Corporate website, Social Community, Website\n  - Tags: sharepoint, corporate website, microsoft, office 365, amaxra, collaborative development",
        "selected": true,
        "webDocId": 245,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": "Android, BlackBerry OS, iOS, Mac OS, WebOS, Windows"
          },
          {
            "key": "Devices",
            "value": "Web"
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": "sharepoint, corporate website, microsoft, office 365, amaxra, collaborative development"
          },
          {
            "key": "Categories",
            "value": ""
          },
          {
            "key": "Published",
            "value": "2016-02-16T11:28:59"
          }
        ]
      },
      {
        "link": "https://portfolio.abcloudz.com/jzs-electronics/",
        "docId": "c9d987c0-7e0f-4103-a3c2-565550d3b59e",
        "score": 0.3590964078903224,
        "title": "JZS Electronics",
        "content": "- Summary: JZS Electronics is a website based on Amazon Webstore platform. To improve buying experiences and to take advantage of the Amazon platform the customer requested us to enhance their online store. Based on this request our team added some new features, redesigned both the logo and the header. To structure the information about the products we created some new tabs on the product detail pages. We also added shopping cart functionality that wasn't available before. On the newly added Rebates and Promotions page we placed the information about the special offers and mail-in rebates which users can download as PDF files. As a result we've got a much more usable store, which helped the customer to close more deals.\n  - Devices: Web\n  - Programming Languages: CSS, HTML, PHP\n  - Technologies: Amazon Engine, CMS, SharePoint\n  - Industry: E-commerce, Website, Webstore\n  - Tags: php, magento, sharepoint, html, css, webstore, web-development, e-commerce, website, cms, web",
        "selected": true,
        "webDocId": 184,
        "infoBlock": [
          {
            "key": "Platforms",
            "value": ""
          },
          {
            "key": "Devices",
            "value": "Web"
          },
          {
            "key": "Tech stack",
            "value": ""
          },
          {
            "key": "Scope of work",
            "value": ""
          },
          {
            "key": "Tags",
            "value": "php, magento, sharepoint, html, css, webstore, web-development, e-commerce, website, cms, web"
          },
          {
            "key": "Categories",
            "value": ""
          },
          {
            "key": "Published",
            "value": "2012-07-30T12:55:16"
          }
        ]
      }
    ],
    "matchedBlogs": 10,
    "matchedBlogsData": [
      {
        "link": "https://apps.abcloudz.com/case-studies/online-marketplace-development/",
        "docId": "66a0297a-c3aa-42b1-b574-e621cf8632ba",
        "score": 0.2940622813627385,
        "title": "Online marketplace web site development",
        "content": "Many businesses rely on selling products. And when people want to sell products, some may say: “Go to eBay or Amazon and sell”. But what if you don't want to pay fees to offer products. Or what’s more, what if you want to create a platform on your own? Surely, disrupting the market is tough, but the example of Etsy proved that it's possible, especially if you aim at a niche area. ABCloudz has vast experience with online marketplace development. We build business platforms for your needs and making them engaging for all sorts of customers. Our experienced team knows how to create scalable marketplaces optimized for high volumes of traffic that help you grow sales and boost conversion rates. Creating an application your customers will love Thanks to numerous completed projects, we have developed a steady approach to make every project a striking success. We excel at implementing 5 key steps that ensure your future marketplace will run fast, look pretty, and facilitate all essential features. Online marketplace development is easy, and this is how we do it. Getting to know you ABCloudz has solid expertise in addressing customers' needs and takes into account your goals, area of activity, and business model. Regardless of your business model, be sure that our engineers choose and craft a proper website structure to help you achieve business goals. Interface as a connecting tissue To make it appealing to customers, we focus on making its facade attractive and neat. But it's not just about a cute interface. Based on the target audience, we adjust its design to be as intuitive as possible. With customers' needs in mind, we always put ourselves in their place and see how to improve the journey throughout the marketplace. Don’t try to boil the ocean with v1 At this stage, we add specific functionality to the marketplace and see how the core product will look. We develop and add specific products, categories, inventory, buyers, vendors, search, filter, payments, orders, etc. Seeing only the necessary functionality is a great way to display core features and save time and money. Our developers use the latest technology standards and apply their experience to make a marketplace that is scalable, easy-to-maintain, and secure to all sorts of breaches. We are also able to add new functionality after the market is deployed or during its development. Thorough testing equals no surprises Once the MVP is completed, we perform extensive testing of website features and make sure it's all working. Our team conducts stress tests, visual appearance inspection, platform compatibility, etc. Based on the test results, we analyze website performance and optimize its code to make sure you get a well-oiled engine. Respond quickly with enhancements We also take care of the deployment process and ongoing support. Our developers will monitor the website’s performance and address all possible questions regarding its activity. Once deployed, the end product will feature robust tools for content management. They will help you add new goods, modify payment options, swap images, view traffic, and many other options. Using the right technology for online marketplace development Thanks to using Amazon Web Services as the back end, we create fast and secure apps. What’s more, your application will be lightweight — our devs compress HTML/CSS code and protect its data using SSL protection. We also make sure your customers will enjoy clean user-friendly UI and easy navigation through the site, powered by Elasticsearch. On top of a handy Content Management System, our developers will give you a rich toolkit for managing the system onwards. This includes providing SEO insights, sending push notifications, etc. Why ABCloudz? We at ABCloudz care about our products and deliver quality. We also believe that creating an online marketplace is the best way to boost sales and elevate conversion to a new level. Contact us to discover the advantages of making a web-market that was tailored for your business needs.",
        "selected": true,
        "webDocId": 362,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-06-16T12:20:14"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/building-a-world-class-city-guide-app-with-ar-features/",
        "docId": "a837073d-6d43-4161-8216-a87a729fb0f7",
        "score": 0.2506890594137836,
        "title": "Building a world-class city guide app with AR features",
        "content": "As the world recovers from impact of the COVID-19 pandemic, we are witnessing a return in demand for tourism and travel apps. Hindered by a two-year pause, the market is poised to reach a growth rate that is higher than any pre-pandemic metrics. It is expected that it will grow at a rate of 12.2% between 2021 and 2028. The market may also reach USD 14.4 billion by 2028. This means there's definitely tourist demand that needs satisfying. A quality city guide tour application brings greater trip flexibility that boosts the demand for real tourism services. That's why building such an app is a good idea for both startups and existing businesses in the tourism and hospitality industry. As a company with a rich experience in custom application development, including city guide apps, ABCloudz is ready to share its experience with you. City Guide app: must-have features In our rich software development practice, we have developed numerous tourism apps that includes the most demanded features. The set of features for such applications is extremely rich and depends on your most ambitious ideas. We can also outline a few must-have features without which your city tour app won't be competitive. And we successfully implemented all of them while developing a global tourist app with AR-driven mechanics for an ambitious software startup.     VR/AR integration VR (virtual reality) and AR (augmented reality) are among the hottest software development trends. If your user needs interactivity, Augmented Reality (AR) integration or VR features may become your city guide's main selling points. You can allow your users to watch AR objects or tour guides through the lenses of their cameras while visiting specific locations. Our suggestion is to use Unity, the world's leading cross-platform framework for real-time 3D development. It allows you to create AR/VR experiences 30% faster with customizable templates and scripts for 3D modeling. One of Unity's greatest benefits is that it allows you to write both JavaScript and .NET code, which brings greater flexibility to developers. We recommend using Entity Framework Core to create .NET code. This solution provides simple and customizable camera configuration. It is a perfect feature for apps that allows users to watch AR components through the camera lens. Besides, Unity is a great option for cross-platform development. The platform allows you to create different builds with platform-specific SDKs (mobile, web, desktop). All these builds roughly include the same code. This benefit helps you save the time and cost required for building separate app versions for different platforms. For example, you can build a frontend for an AR web app with Unity Web by using Zappar's Universal AR SDK. In this case, you will use the same code as while building Android or iOS app versions. However, it is not the only option for building frontend for an AR application. Based on our expertise, building Angular frontend enforced by the A-Frame AR development framework is also a good choice. In this case, you will also get numerous AR development templates that will speed up the development process. Besides, this solution provides for a simple deploy configuration and brings all the benefits of Angular framework, like integration with a large ecosystem of Angular development tools, top-notch security, and excellent performance. Unique and informative interface A city guide app must be convenient for the user and provide them with everything they need. So, a user-friendly and consistent UI/UX design is a must. But a convenient map with the most popular tourist destinations and the “launch a tour” option won't be enough if you want to build a potential market leader. Consider adding more information on locations or tours in your application. For example: Peak visitation times for locations Ranking of high-traffic locations System of reviews for various locations Different tour types for the same location (for example, history-oriented, culinary tours, art trips, etc.) Personal cabinet with favorite locations and collections of visited locations Photo-sharing feature as a part of the app's social component. Google Navigations & location-based content The content of a good city guide app should be connected to specific locations. That's why integration with a navigation system is mandatory. The ABCloudz team has integrated the tourist app with Google Maps. There are multiple ready solutions for integrating location-based apps with Google Maps. Besides, Google Maps is known for its precision and offline navigation features, making it a perfect solution for our application. Offline accessibility Let your user access city tours without connecting to the Internet. The solution is technically simple. The users can download video guides for particular locationslocations and launch them while visiting these locations offline. AWS Elemental MediaConvert will help you manage the size of these videos so that they won't be too big for user device storages. Chat & social networks integrations The tourism and hospitality industries are well-known for their vibrant community. People like to share their photos, reviews, and emotions from various trips and rely on the reviews of others while making their travel decisions. For this reason, social features may increase your app's popularity dramatically. We at ABCloudz have strong expertise in building chat-based mobile solutions. In our experience we use chat integration tools, such as Openfire, to add secondary communication features to your software. We also apply social media integration APIs, as well as our custom practices, to provide seamless integration of city guide apps with the world's most popular social networks.",
        "selected": true,
        "webDocId": 371,
        "infoBlock": [
          {
            "key": "Tags",
            "value": "application-development, aws, mobile-apps"
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2023-01-05T16:33:21"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/flutter-based-application/",
        "docId": "4ac515a1-249a-4eec-9f91-96abbfa8d533",
        "score": 0.24309927225113093,
        "title": "Cross-platform apps built on Flutter",
        "content": "In 2020, mobility is the name of the game. Mobile traffic accounts for over half of web traffic, and the usage of these apps will often drain a customer's time. As a result, when launching a product there should be a fast-running mobile version. To make the app far-reaching — Flutter is the way to go. It enables cross-platform development with plain code management that grants stark UX and vast customization levels to end users. With Flutter, you can reach every platform and attract as many users as possible — and our developers know how to turn your idea into a cohesive and snappy product. See the video showing our team’s approach to creating Flutter applications. The technology behind Flutter application development Flutter is a neat SDK for creating mobile apps from Google. And while it stays true to its name, the Flutter-based application is equally snappy on both Android and iOS platforms. We ensure that the ported version works as the native application from the very moment a user launches a splash screen. In fact, top-notch performance is what stands out among Flutter advantages to secure its stable performance during peak loads. What's more, our developers make the best of the available API. Based on the .NET core server, we equip the app with the AWS cloud solutions and make its interaction with the client app and database sleek and joyful. The best fit Flutter is a proven technology for building corporate networks with maximum user functionality. In our recent Team News product, the developers introduced a wholesome environment, where the owner can create and manage whole companies and virtually every other aspect of the app. It starts with creating a company unit. Then the owner invites employees and assigns group admins. At its core, the app works like a typical social network, so what's the fuss? The Flutter application development is fast and grants full control over its customization. While it lets users create, like, and share posts with other users, the owner can manage UX in the app's day-to-day usage. Additionally, it gives the means to control both notifications as well as feed logic and appearance. Welcomed everywhere Our developers squeeze maximum performance out of Flutter so the cross-platform performance is carved in stone. Regardless of the platform, the ported version is neck-and-neck with its original, making it snappy and accessible. Whether it's iOS or Android, the app logic and interface remain identical and the app runs smoothly on desktop and web as well. Such things as scrolling, icons, fonts, and menu navigation will also be in rock-solid interaction with Flutter widgets. Also, we have hands-on experience in crafting a separate rendering engine to accustom the app behavior to the product's needs. Backed by a vast number of supported libraries and packages from Google, the app can include numerous features such as Google Maps, easy logging via Twitter, Facebook, Google, video and camera content interaction, etc. Benefits Making a flutter-based product is a win-win scenario — you get a feature-rich app that works under any condition. We also build a UI with fluent animations and menus with glorious widgets for high-frequency displays. If an app is a car, a Flutter-based app is a race car because it speeds up development time, performance, and the crucial time to market parameters. Go for it Talk to us and see how we can make your business mobile and cute. Use the power of cross-platform solutions to deliver food and control every step of its operation.",
        "selected": true,
        "webDocId": 363,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-07-30T09:57:12"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/chat-based-mobile-application/",
        "docId": "5d4abbd7-d823-4fc9-9111-99cf0e4f8b75",
        "score": 0.22627574205398715,
        "title": "Chat-based mobile application",
        "content": "Long gone are the days when people exclusively relied on phone calls to connect. Nowadays, when people don't see each other, they move towards messengers — both text and video methods — instead of calling. At ABCloudz, we understand the importance of user interaction when messaging online and we can provide the means to make it a striking experience thanks to solid technical background and interactivity features. If we talk about the chat feature in apps it is generally utilized in two scenarios: when it's the main app-selling point, or when it's a cool addition to already existing functionality inside an app. Being different implementation-wise, we enable both options and bolster them with modern-day technologies to support safe and snappy connection. Technical aspects Because we come from the data world, we pay extra attention when designing the future-state architecture. In both cases, you pick a technology that facilitates your goal the best — Ejabberd is a great choice for standalone chatting, while Openfire makes it a great secondary feature in apps. Unlike its Java-based counterpart, Ejabberd provides vast opportunities for growth and supports retrieving messages even in offline mode. This is a solid advantage for an app that puts its focus on communication — users often use private messages as a kind of storage. On top of that, Ejabberd allows for displaying users' last activities, SSL security measures, various plugins, and push-notifications in offline mode. Keeping your data private We put extra emphasis on using two-factor authentication to make apps immune to breaches from all possible attacks. During the first log-in, we ask for a customer's phone number and send a verification code for them to enter. It is a complex system that contains numerous phases on the server side. We implement registration in several steps: the initial registration saves credentials on the server and then uses an API to ask the XMPP server to create an account. The backend server gets the info and duplicates it for storage. After a user logs in, the service layer will receive a query from the client to send user credentials. The server verifies and matches this data and returns it back to the client to then validate credentials with the XMMP server. Despite sounding like a convoluted route — the whole process is done instantly, and the user is free to log into the chat. Glorious user experience What makes the experience even better is the interactivity features. We add sound effects to emojis, a valuable feature for Android smartphones that don't have such capability by default. The support for Google keyboard is another step to add typing convenience and tons of icons, animations, and images. When it comes to the interface, our developers know how to make menu navigation and buttons placement intuitive. We also enable sleek animations using Lottie and tune their performance based on the app needs. Checklist of must-have features If it's a chat mobile application development, we always implement the following features: Chat list. All the previous chats will be stored in a separate menu and available for viewing, editing, and deletion Creating new chats, groups, adding friends. To make it a fully-fledged chat platform, we always add social interaction features Sending texts and all sorts of files between users, which is the cornerstone for chat-based apps Safe end-to-end encryption for extra privacy Our dev team is proficient in making chatbots that are powered by machine learning algorithms. Thanks to Google Dialogflow and Amazon Lex, bots are capable of recognizing text and voice speech and its tone determined by neural networks. Mobile apps gain The prospects are limitless. And believe it or not, these days many people abstain from phone calls altogether and prefer using messengers. The reasons are aplenty: work environment, sleeping schedules, and the inability to send cat pics using voice. By making your own app, you can benefit from selling virtual goods for users' interaction, be a 3rd party platform for commercial offers, become a platform for corporate groups, and more. Reach us out Contact us and explore the possibilities of chat-based mobile apps. Social interaction is the key to keeping users busy, and we make sure your app supports every present-day chat feature. Enhance your business with a neat mobile solution — our devs know quality and create apps that are scalable, secure, and fast-running.",
        "selected": true,
        "webDocId": 357,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-04-16T09:40:58"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/mobile-ar-e-commerce/",
        "docId": "e2c4982a-586d-4818-b6f5-8f64f66d5ff6",
        "score": 0.22101222151445055,
        "title": "E-commerce mobile app with an augmented reality",
        "content": "E-commerce today is very common — and most people can't imagine a business launching without a web page or an app. But when it comes to AR, some people may view it as a bit goofy gizmo or a gimmick for games like Pokémon Go. So, what does AR offer for e-shops? Simply put, it adds a layer of virtuality applied to real-world objects. It helps customers make the right choices when selecting products via nifty visual presentations. When it comes to applying AR to real business, IKEA was the first big pioneer. In 2014, IKEA allowed shoppers the ability to move catalog objects inside real rooms to decide whether those objects fit or not. In fact, the concept hasn't changed much, it's just that other vendors have now grabbed onto the idea and applied it to their needs as well. This technology has made significant strides regarding market penetration and is no longer a gimmick. Seeing steady growth until recently, AR saw a big spike in popularity after Google introduced its solutions for Search and Maps, exposing AR to a wider audience. What we do Gathering the best practices from across the industry, ABCloudz replicates well-polished AR solutions for online marketplaces. With all the modern iPhones and mid-tier Android devices supporting AR, we aim for the widest audience and make sure our apps run smoothly. ABCloudz produces unique algorithms that analyze surfaces and apply 3D objects to them, and the scope is only limited by the catalog volume. Everything you come across in an online shop, we can transform into an AR-enhanced solution: Furniture to fit into the room space Footwear that shapes around a user's feet Makeup to reflect on a face Jewelry that interacts with limbs, necks, noses, ears Color paintings to apply on a wall Moving objects like vehicles and animals with sound effects Maps and buildings interaction based on GIS data, etc. We take care of the following steps: Asset management— we morph your commodities into 3D objects Uploading— we upload 3D objects to the app catalog Object interaction— we facilitate animations, sound effects, etc. Back end technology— we make objects appear on all kinds of surfaces and enable them to respond to user manipulations As a result, users receive objects that can be zoomed, dragged, turned, and rotated up to 90 degrees. We also enable sound features to make it a realistic experience when users impose AR objects on a real-life environment. Technological approach By utilizing Apple ARKit 3 and ARCore, we provide iOS development as well as Android development powered by AR technologies. iOS From a technological angle, everything starts at the entry point. Generally, it's the AVFoundation framework that helps us process a QR code. It also captures a live picture from a camera that will be used during the last stage of the AR overlay production. The AFNetworking library refines QR data and enables the creation of a file that the system converts to OBJ. Once the system receives an OBJ-file, the MDLAsset container will produce a 3D image. Then, the SceneKit framework is responsible for creating a 3D scene that will be impacted by on-screen gestures and the live picture from the camera to produce a top-quality AR video overlay. Android When it comes to Android devices, mobile AR development is the same but with different tools. We use ARCore as the main platform and enable a multitude of features by refining the entered data from a camera. Motion tracking captures the phone's position relative to the world, environmental understanding defines all sorts of surfaces: tables, walls, horizontal/vertical orientation, angles, etc. Light estimation evaluates lighting conditions derived from the environment. To render realistic 3D scenes, we use Sceneform SDK and its high-level graphical API to enable complex physics on the screen. Obvious AR advantages AR in mobile apps isn't a novelty, rather it's a good business choice for a competitive company. It's also a great way to increase conversion rates — potential customers get to test products and choose what really fits them. AR works as a sort of a wardrobe and greatly reduces refund rates for all sorts of products. Try things out Do you want to know the development cost for an AR product, contact us and transform your project into a lovely journey for your customers? Just as e-commerce became a logical move for retail stores, AR-powered marketplaces are yet another step in the right direction.",
        "selected": true,
        "webDocId": 359,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-04-30T10:20:41"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/video-based-app/",
        "docId": "f31337c2-c729-4d09-822e-df88b62768ae",
        "score": 0.16296983283938005,
        "title": "Video chat-based mobile application",
        "content": "Video chat technology has been around for a long time. Rightfully so, Skype was among the first companies to connect people using video broadcasts. And we are still there in terms of technology — it's only the signal quality and the number of programs that have increased. When it comes to the desktop platform, I could name you several rivals and that's it, not much for more than a decade since we met Skype. The mobile platform is also surprisingly shallow — after you search for a video-based app, you will be offered tons of ChatRoulette clones that offer no real value. Once again, we have Skype and Messenger but they lack functionality for managing large groups of people. Being keen on data management, ABCloudz creates video calling apps that fit broader video chat goals entirely. We know how to make it run fast, secure data privacy, and include customization features. Tech WebRTC is the cornerstone for creating solid interactions between users. To unleash its full potential, we utilize Twilio API for both the authentication and signal transferring measures. Apart from regular messaging, Twilio provides broad opportunities for weaving programmable video functionality. It also fits both iOS and Android app development when implementing such features as video room controls, setting up local media, managing remote participants, reconnection features, and more. What's more, we actively use Wowza API to enable mobile streaming and make broadcasting easy. Our developers implement adaptive playback, extensive VOD management, player core functionality, and secure low-latency performance. Video REST API For mobile application development, programmable Video REST API does the heavy lifting. Starting from the back end server and using HTTP requests, the app uses the video.twilio.com resources for enabling commands. It's worth noting that HTTPS is used for making requests as the API supports the encrypted way of addressing its core. Authentication We implement basic HTTP authentication to protect video calls using Key Sid and Key Secret from Twilio API. Our developers enable various login methods: username, password, verification codes, and other security measures. Depending on the customer’s needs, it can either be complex encryption or basic login methods for an easy start. Once authenticated, Twilio will keep this info logged for the whole call duration and protect its connection. Rooms Rooms are the core of video calls and we put a lot of emphasis on their functioning. To put it simply, rooms are the sessions between endpoints of Twilio's SDK — even if there are only two participants there will still be a virtual room. Depending on the app needs, we can modify room properties, TURN config, callback status, participant numbers, etc. to customize their experience on a core level. Recordings, compositions Because we are especially knowledgeable on data quips, ABCloudz knows the best practices to establish server-side processes. Our app developers enable storage for recording video chats, video messages, screen captures, playback options and other interactions within a product. Depending on the goals and the scale of your app, we can enable AWS Media Services, Google Cloud for Media, and Azure Media Services. Our developers also grant access to every bit of data and command statuses of the app flow. User Interface To enable convenient app usage, ABCloudz takes the best of Lottie. Made for custom animations, we transfer Lottie components to apps and turn them into responsive UI elements for menu navigation and making or receiving video calls. Consisting of JSON and XML files, it sets the parameters for animation behavior based on your needs. While XML is responsible for enabling certain elements, the JSON body includes: Timing — animation duration and delay Shapes — paths, primitives (rectangles, circles, lines) Properties animations — rotation, position, scale Color properties — solids, gradients, raster fill Try it out! Contact us and start making your own product! Whether it's a small corporate app for comms or a fully-fledged messenger, video functionality elevates your app to a new level. Instant connection and smooth animations leave a lasting impression on anyone who dares to use it.",
        "selected": true,
        "webDocId": 360,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-05-21T10:10:42"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/custom-social-networking-app/",
        "docId": "f494fc7f-f8d9-43b9-a947-f82e4f6d7287",
        "score": 0.15146899223327748,
        "title": "Social networking application with custom matching",
        "content": "Everyone knows about social networks. Seriously, mobile devices have reached every corner of our planet and have enabled people to chat with each other from across the globe. But what's the point of making another app if there's Facebook, right? Actually, it makes sense if you look at the stats — the number of users is growing and shows no signs of stopping. Neat features are what make small apps viable and we have the prowess to implement them. Along with things such as chat, reactions, updates, and video-messages, ABCloudz provides custom matching and search algorithms for these apps to craft a tailor-made solution for your needs. Technical features Building apps from scratch isn't easy. But ABCloudz has already developed finely tuned practices when it comes to making a complex product with unique features. How we do it The first thing to come to mind is connecting people. So how do we do that? The search button is the way to go — it will display results and define how people connect. If we talk about Facebook or Instagram, the search result will show people, posts, photos, and videos. The search engine uses special parameters that were set up on a core level as to what's relevant and what's not. But what if the app isn't meant to be the next big thing? If it targets people from certain communities, there should be specific searching parameters. In this case, Tinder-like matching is the proper choice that actively promotes people's communication and ties them based on interests and location. Location First, map integration should be added. By using Google Maps API, our developers can tune the search outline and specify certain areas for the search. For instance, if it's a baseball community, it would make sense to restrict the search range by a single city. If people are interested in other bats – let's say, those who make flapjacks – it's better to limit the area by several neighborhoods. Storage With the amount of data flow inside the app, storage becomes an important topic for a product's stability. The text chat is easy to handle, but media files can pile up and weigh a ton. That's why data questions should also be considered among others. Being the cornerstone of the ABCloudz expertise, we approach data management firmly. Our app developers are keen on using native cloud storage like Microsoft Azure, Amazon RDS, and Google Firebase as well as on-premises databases. When it comes to social apps, we give an edge to MongoDB as our primary choice. It fulfills general requirements for information storage making it secure, scalable, and highly available regardless of the amount of traffic. Meeting calendar In speaking about local interests, it's certain that people will want to meet one another. So, it makes perfect sense to promote users' hangouts where people's activities can be common and shared. As in other apps, we can make a Meetup calendar to create meetings, add or tag participants, choose a place on a map, add a description, etc. Our team has vast experience in making interactive calendars inside apps and delivering top-notch UI for that function. Matching algorithm To enable high user activity, you can make a user's rating reset once they upload a new profile pic or a video. Even after putting a negative mark, there will be a chance for people to match again and start chatting. Apart from filters, both search and matching are based on tags. Whether it's certain activities or a favorite team's name, it will be considered when selecting people to hook up. Technology-wise, REST API is the common solution for chat interaction, user authentication, and searching. At the same time, WebSocket plays its role in chat activities and notifications. Proactive app You don't have to be Nokia to connect people — a small yet scalable app can be a sleek solution for that goal. Unlike large social networks, your app will promote matching based on parameters that you choose to ensure high engagement levels. Get the quality Request a quote from our sales staff and start custom app development for your needs. Your solution will incorporate all the necessary functionality for a successful social network. To ensure the app is under your robust management, it will contain extra features and tools to tune its core logic and activity patterns.",
        "selected": true,
        "webDocId": 358,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-04-23T10:05:33"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/spyfall-mobile-game/",
        "docId": "38fd0875-0729-47ad-96d0-e43a84713caf",
        "score": 0.14120133869640028,
        "title": "Spyfall Mobile Game",
        "content": "Times are changing along with the rest of the world. Years ago, you played Monopoly with your whole family and quarreled over who would take which property and who secretly stole which cards. Those were great times. But now, everything has changed. You have changed. And our life has become much faster. You no longer have time to set up the pieces to play a board game. You want it right now, in the pub, where you relax with your friends and think about activities you can all do together. And now, there is a solution to this problem! What one thing is always with you? What has become an extension of your hand? Yes, your mobile phone. And today you can play your favorite board game with your friends everywhere. One of the board games that has become a mobile app is Spyfall. It's an easy-to-learn game of bluffing, probing questions, clever answers, and suspicion. To get the feel and purpose of this, check out the following video: Game flow In Spyfall mobile game, all players receive the same cards through the application, except for one. This one player is the Spy. The goal of the game is to uncover the Spy. And the Spy must determine the location shown on the player's cards. Players then start asking each other questions. The first player who answers the question correctly proceeds to ask any other player a question of their own, except the player who asked the last question. Non-Spy players need to ask questions and give answers that prove to other players they know the correct location. But watch out! If your questions and answers are too specific, the Spy will easily guess the location and win, so you need to practice a bit of subtlety. On the other hand, if your questions and answers are too generic, other players may accuse you of being the Spy. So, if you listen carefully to other players, you'll be able to come up with a plausible question or answer. And the winner is… All players may discuss who they think the Spy is. When everyone is ready to vote, each player at the same time points to another player's name. If all Non-Spies point to the Spy, the Non-Spies win. Otherwise, the Spy wins. You can stop the game and declare a vote at any time. Players vote for one person and if it isn't the Spy the game continues. Those who left the game must sit and watch without prompting who is right, wrong, or who they think the Spy is. The Spy is allowed to make a final guess as to where the Non-Spies are, and if they are correct – the spy wins. Technologies we use for application development The ABCloudz app development team brings your idea to production and then maintains and supports your product or application. So, if you have just a desire to turn your favorite board game into a mobile game app, ABCloudz can help bring the idea to life. Our team includes experts in researching, planning, sketching, and of course coding, testing, and deployment as well. That is all you need to deliver a successful mobile app to the market. For instance, we started this project by creating software requirement specifications and wireframes. Our design team then delivered bright animated illustrations to improve the user experience. ABCloudz utilized Flutter to develop the Spyfall mobile game. This technology allows for deploying code on multiple platforms. Therefore, you can significantly save money or increase ROI by reaching out to millions of mobile devices with a cross-platform app like the one used for Spyfall. Benefits ABCloudz provides customers with a full app development cycle. You can rely on our experienced application development team to design and develop a cost-effective mobile app that will replace your favorite board game. As you can see, we have experience in turning board games into mobile apps, so contact us to skyrocket the launch of your game or application!",
        "selected": true,
        "webDocId": 367,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-12-01T12:47:10"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/healthcare-application-security/",
        "docId": "c6ffea55-f063-4931-9b44-3722790da143",
        "score": 0.13708943128585915,
        "title": "Security in healthcare applications",
        "content": "Healthcare is complicated. So is building medical apps. But just when you think you're done and the hardest part is over, there's another hurdle — certification. Such standards as HIPAA, GDPR, COPPA, and FDA are the holy grail in medical privacy. And to make it into the market, the app must comply with these rules as customers' privacy is paramount. ABCloudz nails medical standards with a surgeon's precision. Backed by vast experience in the field, we help healthcare apps meet required security standards. With top-notch documentation and a multi-level security system, it becomes an easy affair for your product. Documentation is a synonym of certification When it comes to certification, there are tons of factors that impact the final result. Namely, documentation is among the most crucial things each set of regulation standards requires. It serves as a reliable source about the app architecture, data storage, mechanics of data collectors and processors, methods of adding or editing data, and other information. We also provide thorough guidelines for the product's usage. This gives regulators a high-level view of key principles and goals the application is designed to pursue in the healthcare industry. How we achieve security in healthcare applications Security is the key to certification and we achieve it using the latest technologies. Modern-day security means a neat combination of physical and digital authorization — one of the ABCloudz prime areas. That's why we use card readers with personal IDs and streaming capabilities to monitor security via cameras. For the digital component, our developers enable 2-factor authentication based on user IDs and restricted rights, access levels, and duration. We also enable automatic log-off, emergency access, and remote data wipe when approaching HIPAA and GDPR requirements. What’s more, our specialists keep logs for databases and local services separately — they can easily be tracked, reported, and updated upon request. The same applies to work sessions whose recordings are stored for future revision. Additionally, the network is secure thanks to applying modern encrypted communication protocols, including HTTPS. Enabling eSign is another fruitful technology we implement to secure the highest security level. Cloud convenience With hands-on experience in the cloud area, we use the best of this technology to ensure compliance standards. Powered by such solutions as Datica, we can implement private communication between each app user in the cloud environment. Another advantage would be delivering backend encryption using such tools as Auth0 to provide extra security. We help you reach the market Managing private data is a sensitive question that should be approached thoroughly. Because of our experience in building apps that fully comply with all sorts of standards, we can take care of the entire process to help you avoid obstacles. Don’t wait, go for it! We at ABCloudz know what healthcare is all about. We conduct a healthy approach to a patient's data and care about the performance of your product when it reaches the market. Contact us and make your product compliant with all major healthcare requirements and regulations.",
        "selected": true,
        "webDocId": 365,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-10-06T13:39:34"
          }
        ]
      },
      {
        "link": "https://apps.abcloudz.com/case-studies/food-delivery-mobile-application/",
        "docId": "b6348a1a-9b3c-440c-a70e-cb1cfe5281c5",
        "score": 0.10490119696841271,
        "title": "Food delivery mobile application",
        "content": "Food delivery has huge potential. Until recently, what seemed like a fad for posh people is now a multi-million dollar business across the globe. And the numbers speak for themselves: about half of the US population has used food delivery and this statistic is growing among every demographic group. There's probably a dozen reasons why this business model exploded, but the most relevant reason is the convenience of the mobile app. When a customer wants food from Subway, Taco Bell, Pizza Hut, Domino's, or from a grocery store, an app becomes an easy way to get things going. It connects both parties and leverages convenience to a new level — choosing a dish becomes fast and easy. We at ABCloudz make sure a food delivery app incorporates all the necessary features and categories. On top of fast food and restaurant chains, you will be able to add supermarkets, cosmetics, bookstores, flowers, and more. And, you can adjust it the way you want. A separate menu for ‘any request' is a nice feature where users could enter specific needs via messages. Technological aspects The solution will include a hefty amount of technological decisions. Here's how we make it work. Tracking Tracking is an essential part of the app flow. From start to finish, customers should be able to see the stage of their orders and we can enable numerous steps for their displays. As a rule, there are five general steps: Processing — the order has been accepted and is going through initial steps Preparation — the product is being cooked or purchased Receiving — the product is being loaded into the package and put onto a vehicle Delivering — the product is on its way and a customer can see the full route on a map Completed — the product has been received and paid for by a customer When it comes to GPS tracking, Delivering is the most important step. We incorporate Google Maps by using its API and show all courier activities on a map. Once a carrier starts moving, the app shows the approximate time to reach the destination based on distance and vehicle type. The app will also calculate the time for order completion before it starts — it will suggest hours based on travel distance. It automatically detects a user's device location and offers the shortest delivery route and the estimate. The app will also spot a user's location and suggest it as a delivery address. If a user wants delivery to another place, the app will let enter this data in the order or in the settings menu. Storage To store and process orders data, our team utilizes numerous databases. Depending on the app scale and needs, it can utilize traditional storage or a cloud solution — Amazon AWS, Google Firebase, or Microsoft Azure are our areas of expertise. Those options provide more agility for app functioning and provide stable performance under all sorts of queries. Payment systems Besides the norm of cash payments, our developers enable traditional credit cards and custom wallet methods. Powered by MasterCard, VISA, PayPal and other system's APIs, the app can have multiple payment options to ensure customer convenience. Cryptocurrency wallets can also be added for extra convenience. Application interface ABCloudz has vast experience in crafting a practical and engaging interface. Thanks to Lottie animations, our developers created an intuitive UI that can be adjusted by users. They will be able to drag menu elements and make it appear in lists or circles. Custom map elements will also show flags, vehicles, and highlight major spots on a courier's route. Apart from purchase pages, the UI will include an account page, settings, promo codes, purchase history, search, favorites tab, and referral systems. We also implement a notification system that informs the user about every delivery stage even if the phone is on the lock screen. Tapping on that message will bring users to the app tracking window showing the current order details. Benefits Our devs have on-field knowledge in mobile application development and they know quality. We make sure the app owner has a rich toolkit for adjusting the app work and adding every bit of functionality. At the same time, users will appreciate a fast-working product with a clean UI that streamlines their meal experience. Go for it Talk to us and see how we can make your business mobile and cute. Use the power of cross-platform solutions to deliver food and control every step of its operation.",
        "selected": true,
        "webDocId": 355,
        "infoBlock": [
          {
            "key": "Tags",
            "value": ""
          },
          {
            "key": "Categories",
            "value": "Uncategorized"
          },
          {
            "key": "Published",
            "value": "2020-04-02T15:40:43"
          }
        ]
      }
    ],
    "presetId": "2126eb63-45d7-4af2-a65b-073c3b362039",
    "accountId": 1,
    "review": {
      "type": "Like",
      "comment": "nice"
    }
  },
  "error": null
}