{
  "success": true,
  "statusCode": 200,
  "data": [
    {
      "id": "dc54ea45-1de5-45bd-b6f3-876fdf8c9d7c",
      "content": "3+3",
      "created": "2024-01-09T08:20:46.907Z",
      "isBot": false,
      "accountId": 1,
      "chatId": 159
    },
    {
      "id": "fd9e6436-b478-4221-b865-79837cff55a4",
      "content": "\\Technical keywords: 3, 3\n\n\\Industries: Not applicable\n\n\\Summary: The customer requested the sum of 3 and 3, which is 6.\n**ABCloudz Portfolio**: \n[Templates Pro Apps](https://portfolio.abcloudz.com/templates-pro-apps/)\n- Summary: The series of Templates Pro applications contains an extensive collection of templates for MS Office and iWork. The easy to understand interface of the applications lets users easily navigate through suggested templates and find the right one from the diverse categories of Word documents, PowerPoint themes and Excel spreadsheets. All the templates have professional design and are ready to use for business, educational or private purposes.\n  - Platforms: MacOS\n  - Devices: Desktop\n  - Tech stack: Objective-C\n  - Industry: Business, Desktop Development, Desktop Software, Software\n  - Tags: objective-c, desktop development, desktop software, desktop}\n----\n[Talley Oil Materials iOS](https://portfolio.abcloudz.com/talley-oil-calc-ios/)\n- Summary: Talley Oil Materials is a calculator app developed by ABCloudz Custom Dev team for one of our clients – pavement service provider, and asphalt and road oil manufacturer. This app provides you with several calculators that help you establish a required order size of the road mix based on the road parameters. To calculate the number of “hot mix” tons required for paving, the user simply needs to set the road parameters:the width, the length, and the thickness. The app automatically calculates the work area and the uncompacted volume. Using the same app you can calculate the required amount of sand and gravel. It works exactly like the previous calculation: you simply set the road parameters, pick the aggregate, and the app calculates the estimated number of tons required to construct it. In the same way a user can calculate the amount of road oil and emulsion, ready mix, aggregate spread rate, oil spread rate and even spreader truck calibration. The application also has a GPS tracker with the help of which the user can measure the road, and a Talley counter for various calculations.\n  - Platforms: iOS\n  - Devices: iPhone\n  - Tech stack: Core Graphics,Core Location,iOS SDK,\n  - Industry: Audio, Business, Mobile Application\n  - Tags: objective-c, iOS, mobile development, ios sdk, core location, core graphics, calculator, mobile}\n----\n[Application Development Portfolio](https://portfolio.abcloudz.com/)\n- Summary: ABCloudz is a global IT Consulting and App Development company focused on building web, mobile and IoT business applications utilizing the latest technologies and cloud architectures. Our team has developed multiple ground-breaking products and created many impressive mobile apps with over 350 mobile apps and over 150 websites and business apps delivered. ABCloudz is built \\[…\\] ,}\n----\n[Application Development Portfolio](https://portfolio.abcloudz.com/)\n- Summary: ABCloudz is a global IT Consulting and App Development company focused on building web, mobile and IoT business applications utilizing the latest technologies and cloud architectures. Our team has developed multiple ground-breaking products and created many impressive mobile apps with over 350 mobile apps and over 150 websites and business apps delivered. ABCloudz is built \\[…\\] ,}\n----\n[Commercial Advertiser & Partner](https://portfolio.abcloudz.com/commercial-advertiser-partner/)\n- Summary: Commercial Advertiser & Partner is a SharePoint 2013 and Office 365-based website, designed for project tracking. It allows to see project status, release dates, and the person responsible for each project. Website features rich functionality. On the main page customer can see list of available and active projects. Once selected, full project details can be viewed. Design of the webpage features set of slightly customized standard elements to fit required design guidelines. Status page is also dynamic. We're grabbing data from remote lists to check market health status in each region. This is a great example of a website that ABCloudz has developed using latest Office 365 and SharePoint 2013 technology. To know more, please, watch our full video presentation above.\n  - Platforms: Android,BlackBerry OS,iOS,MacOS,Symbian,WebOS,Windows,Windows Phone\n  - Devices: Web\n  - Tech stack: SharePoint, , ASP .NET,jQuery,Office 365, CSS,HTML5,JavaScript\n  - Scope of work: UI/UX design; Website development; Performance tuning; Quality assurance;\n  - Industry: Corporate website\n  - Tags: jquery, html5, microsoft, web}\n----\n[Dump Truck Math Android](https://portfolio.abcloudz.com/dump-truck-math-android/)\n- Summary: A simple Android application that brings dump trucks and contractors together. Estimators, truck owners, and project foremen alike can benefit from easy-to-use calculators which put all routine calculations conveniently at their fingertips. The application helps calculate expenses for construction and trucking industries. It includes three convenient trucking calculators: Rate per Ton or CY, Trucks Needed, and Haul Difference. Dump Truck Math can help you get the job done on time and under budget. ABCloudz utilized Java to create the Dump Truck Math Android application. The ABCloudz team also designed and built the graphical interface for the app. Be sure to check the Dump Truck Math application on Google Play.\n  - Platforms: Android\n  - Devices: Android Phone, Android Tablet\n  - Tech stack: Java\n  - Scope of work: Android client development Back-end and front-end development Software design and architecture Deployment Quality assurance\n  - Industry: E-commerce, Industry application\n  - Tags: mobile application, android, calculator, mobile, construction}\n----\n[Walibi iOS](https://portfolio.abcloudz.com/walibi-ios/)\n- Summary: The application was designed to introduce park visitors to attractions, food facilities and plan their leisure in advance. Our developers needed to include a complex object map that showcased the location of each attraction. What's more, we added a rating system and booking capabilities for each attraction. It was a necessary step to improve users' convenience and make interaction easy. As a result, our team delivered a solid app that covered every customer's needs. The users can book tickets, see waiting and opening times for attractions, restaurants' schedules, shops, toilets, and other services' availability. Additionally, we enabled GPS-tracking that suggests the time and distance needed to reach certain attractions. Users will also see which shows and attractions are around their current place at the moment. Powered by Swift for iOS, our developers added notification support and recommendation algorithms that advise users about shows and attractions based on their ratings for each of the visited facilities.\n  - Platforms: iOS\n  - Devices: iPad, iPhone\n  - Tech stack: Google Maps,Glide,Retrofit,Google Authenticator,Reach 5,Okio, , , Swift\n  - Scope of work: Software design and architecture iOS client development Back-end and front-end development Quality assurance Deployment\n  - Industry: Entertainment\n  - Tags: iOS, Mobile Application Development}\n----\n[Dump Truck Math iOS](https://portfolio.abcloudz.com/dump-truck-math-ios/)\n- Summary: A simple iOS application that brings dump trucks and contractors together. Estimators, truck owners, and project foremen alike can benefit from easy-to-use calculators which put all routine calculations conveniently at their fingertips. The application helps calculate expenses for construction and trucking industries. It includes three convenient trucking calculators: Rate per Ton or CY, Trucks Needed, and Haul Difference. Dump Truck Math can help you get the job done on time and under budget. ABCloudz utilized Objective-C/Swift to create the Dump Truck Math iOS application. The ABCloudz team also created the graphic design of the app. Be sure to check the Dump Truck Math application on App Store.\n  - Platforms: iOS\n  - Devices: iPad, iPhone, iPod\n  - Tech stack: Objective-C,Swift\n  - Scope of work: iOS client development Back-end and front-end development Software design and architecture Deployment Quality assurance\n  - Industry: E-commerce, Industry application\n  - Tags: mobile application, iphone, iOS, mobile development, calculator, construction}\n----\n[Chami Educational iOS](https://portfolio.abcloudz.com/chami-educational-ios/)\n- Summary: A marvelous educational application for learning foreign languages. This app helps in finding the closest tutor on the map in real time. You can choose the most qualified tutor with the appropriate skills and suitable service price. Moreover, the students can review the tutor's assessments and feedbacks. ABCloudz created a special Rating function for tutors that helps students to pick up the best possible tutor. We can implement this approach for any applications that need a rating system. We integrated an easy-to-use Stripe payment system that allows you to pay for tutoring services online. In addition, we developed a custom-tailored server side and implemented a user-friendly Angular2 admin panel. Also, we utilized Amazon S3 Buckets to store media content in the application. Watch our video review to learn more about the technical side of ‘Сhami Educational' project.\n  - Platforms: iOS\n  - Devices: iPad, iPhone, iPod\n  - Tech stack: Amazon S3 Buckets,PushSharp,Stripe, , Alamofire,Facebook SDK,Google Maps SDK,Socket.IO,Stripe iOS SDK,MapKit, Swift\n  - Scope of work: Application development Server side development CMS implementation Graphic design UI/UX design Quality assurance\n  - Industry: Education\n  - Tags: education, navigation, search}\n----\n[Heads Up](https://portfolio.abcloudz.com/heads-up/)\n- Summary: A web-portal intended to simplify textbook adoption process for teachers, and to help students find necessary books and get good deals on them. , Our customer’s concept of the ‘Heads Up' web-portal was initially very vague and turned this project into a set of intricate challenges. The customer wanted ABCloudz to create a tool to simplify the procedure of textbook adoption for teachers and to provide students with the best deals on the books they need. Therefore, we had to develop two completely different sides of one application. The main challenge of the student side was to implement efficient and customizable search tools with different search criteria, which would allow users to get best offers from Amazon. On the teacher side, the customer wanted to have an online committee for teachers with a proper tool kit for time and event management. Our team worked very closely with the customer to help them bridge from the general idea to a very complex product, which contains many aspects of software development: sophisticated UI, complex business logic and the database on the cloud, integration with external APIs. And all of it while keeping the use cases very simple and easy for user adoption. The whole project took almost a year to complete, and is been constantly refined ever since. At the outset, we succeeded to meet the customer's expectations and you are welcome to get more technical details from the video above.\n  - Platforms: Windows,Windows 8\n  - Devices: Desktop, Web\n  - Tech stack: MS SQL Server,Windows Azure, Amazon Product Advertising API, ASP.NET MVC Framework,Bootstrap,jQuery, AJAX,C#,CSS,HTML5,JavaScript,jQuery,SQL Server,XML\n  - Scope of work: Graphic re-design Admin panel development Design implementation Quality assurance\n  - Industry: Education, Info website, Learning cources, Publishing, Social Community, Website\n  - Tags: jquery, css, xml, ms sql, bootstrap, html5, amazon, web\n  - Categories: Web Development}",
      "created": "2024-01-09T08:21:28.296Z",
      "isBot": true,
      "accountId": 1,
      "chatId": 159
    },
    {
      "id": "e2ad7d0c-c925-4bbd-acc6-41e85cb8078b",
      "content": "asdasdas",
      "created": "2024-01-17T10:58:16.438Z",
      "isBot": false,
      "accountId": 1,
      "chatId": 159
    },
    {
      "id": "0054b1dc-3537-49e2-b3eb-1506fbff825c",
      "content": "Hello! I'm TechnoBot. Keep calm and learn React!",
      "created": "2024-01-17T10:58:16.442Z",
      "isBot": true,
      "accountId": 1,
      "chatId": 159
    }
  ],
  "error": null
}
